java/full-report-local.log
Change only number of rows
Entity rows: 1; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.00 s
  Slowest:	2.17 ms
  Fastest:	0.76 ms
  Average:	0.96 ms
  Requests/sec:	99.00

Response time histogram:
  0.760 [1]    |
  0.901 [3706] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.042 [4171] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.183 [1960] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.324 [47]   |
  1.465 [7]    |
  1.606 [3]    |
  1.746 [0]    |
  1.887 [1]    |
  2.028 [0]    |
  2.169 [4]    |

Latency distribution:
  10 % in 0.81 ms 
  25 % in 0.83 ms 
  50 % in 1.01 ms 
  75 % in 1.04 ms 
  90 % in 1.06 ms 
  95 % in 1.08 ms 
  99 % in 1.13 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 10; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-10-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.01 s
  Slowest:	10.31 ms
  Fastest:	5.36 ms
  Average:	6.19 ms
  Requests/sec:	98.99

Response time histogram:
  5.364  [1]    |
  5.858  [1278] |∎∎∎∎∎∎∎∎∎
  6.353  [5688] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  6.848  [2826] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  7.343  [78]   |∎
  7.837  [13]   |
  8.332  [0]    |
  8.827  [7]    |
  9.321  [5]    |
  9.816  [0]    |
  10.311 [4]    |

Latency distribution:
  10 % in 5.78 ms 
  25 % in 6.00 ms 
  50 % in 6.21 ms 
  75 % in 6.39 ms 
  90 % in 6.55 ms 
  95 % in 6.64 ms 
  99 % in 6.87 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 20; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-20-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.01 s
  Slowest:	17.86 ms
  Fastest:	10.52 ms
  Average:	12.20 ms
  Requests/sec:	98.99

Response time histogram:
  10.517 [1]    |
  11.251 [288]  |∎∎∎
  11.986 [3853] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  12.720 [4144] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  13.454 [1111] |∎∎∎∎∎∎∎∎∎∎∎
  14.189 [353]  |∎∎∎
  14.923 [112]  |∎
  15.658 [29]   |
  16.392 [3]    |
  17.127 [4]    |
  17.861 [2]    |

Latency distribution:
  10 % in 11.52 ms 
  25 % in 11.78 ms 
  50 % in 12.10 ms 
  75 % in 12.49 ms 
  90 % in 13.01 ms 
  95 % in 13.47 ms 
  99 % in 14.45 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 30; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-30-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.02 s
  Slowest:	33.48 ms
  Fastest:	16.13 ms
  Average:	18.81 ms
  Requests/sec:	98.98

Response time histogram:
  16.134 [1]    |
  17.868 [2947] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  19.602 [4915] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  21.337 [1367] |∎∎∎∎∎∎∎∎∎∎∎
  23.071 [380]  |∎∎∎
  24.805 [148]  |∎
  26.540 [80]   |∎
  28.274 [38]   |
  30.008 [10]   |
  31.742 [8]    |
  33.477 [6]    |

Latency distribution:
  10 % in 17.33 ms 
  25 % in 17.74 ms 
  50 % in 18.40 ms 
  75 % in 19.40 ms 
  90 % in 20.46 ms 
  95 % in 21.88 ms 
  99 % in 25.71 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 40; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-40-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.02 s
  Slowest:	45.88 ms
  Fastest:	21.60 ms
  Average:	25.55 ms
  Requests/sec:	98.98

Response time histogram:
  21.599 [1]    |
  24.027 [3283] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  26.455 [4080] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  28.883 [1334] |∎∎∎∎∎∎∎∎∎∎∎∎∎
  31.311 [793]  |∎∎∎∎∎∎∎∎
  33.739 [241]  |∎∎
  36.168 [90]   |∎
  38.596 [47]   |
  41.024 [15]   |
  43.452 [6]    |
  45.880 [10]   |

Latency distribution:
  10 % in 23.33 ms 
  25 % in 23.81 ms 
  50 % in 24.53 ms 
  75 % in 26.53 ms 
  90 % in 29.30 ms 
  95 % in 30.86 ms 
  99 % in 35.20 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 50; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-50-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.03 s
  Slowest:	60.01 ms
  Fastest:	28.03 ms
  Average:	32.26 ms
  Requests/sec:	98.97

Response time histogram:
  28.027 [1]    |
  31.226 [5350] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  34.424 [2510] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  37.623 [1216] |∎∎∎∎∎∎∎∎∎
  40.821 [564]  |∎∎∎∎
  44.020 [183]  |∎
  47.219 [49]   |
  50.417 [19]   |
  53.616 [4]    |
  56.815 [3]    |
  60.013 [1]    |

Latency distribution:
  10 % in 29.47 ms 
  25 % in 30.08 ms 
  50 % in 31.00 ms 
  75 % in 33.67 ms 
  90 % in 36.90 ms 
  95 % in 39.19 ms 
  99 % in 43.19 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 60; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-60-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	103.64 s
  Slowest:	70.19 ms
  Fastest:	33.96 ms
  Average:	41.08 ms
  Requests/sec:	95.53

Response time histogram:
  33.958 [1]    |
  37.582 [3116] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  41.205 [3066] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  44.829 [1702] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  48.452 [1005] |∎∎∎∎∎∎∎∎∎∎∎∎∎
  52.076 [501]  |∎∎∎∎∎∎
  55.699 [270]  |∎∎∎
  59.323 [152]  |∎∎
  62.946 [63]   |∎
  66.570 [18]   |
  70.193 [6]    |

Latency distribution:
  10 % in 35.96 ms 
  25 % in 37.05 ms 
  50 % in 39.50 ms 
  75 % in 43.53 ms 
  90 % in 48.57 ms 
  95 % in 52.20 ms 
  99 % in 58.84 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 70; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-70-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	118.99 s
  Slowest:	74.65 ms
  Fastest:	38.83 ms
  Average:	47.25 ms
  Requests/sec:	83.20

Response time histogram:
  38.834 [1]    |
  42.416 [1614] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  45.997 [3443] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  49.579 [2226] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  53.161 [1268] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  56.742 [701]  |∎∎∎∎∎∎∎∎
  60.324 [334]  |∎∎∎∎
  63.906 [162]  |∎∎
  67.487 [108]  |∎
  71.069 [28]   |
  74.651 [15]   |

Latency distribution:
  10 % in 41.87 ms 
  25 % in 43.15 ms 
  50 % in 45.85 ms 
  75 % in 49.86 ms 
  90 % in 54.56 ms 
  95 % in 58.16 ms 
  99 % in 65.18 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 80; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-80-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	136.69 s
  Slowest:	95.71 ms
  Fastest:	45.12 ms
  Average:	54.29 ms
  Requests/sec:	72.43

Response time histogram:
  45.119 [1]    |
  50.178 [3269] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  55.237 [3210] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  60.296 [1791] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  65.355 [907]  |∎∎∎∎∎∎∎∎∎∎∎
  70.414 [435]  |∎∎∎∎∎
  75.473 [185]  |∎∎
  80.532 [67]   |∎
  85.592 [26]   |
  90.651 [7]    |
  95.710 [2]    |

Latency distribution:
  10 % in 47.92 ms 
  25 % in 49.31 ms 
  50 % in 52.54 ms 
  75 % in 57.38 ms 
  90 % in 63.33 ms 
  95 % in 67.72 ms 
  99 % in 75.56 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 90; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-90-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	153.42 s
  Slowest:	104.39 ms
  Fastest:	50.83 ms
  Average:	61.00 ms
  Requests/sec:	64.53

Response time histogram:
  50.833  [1]    |
  56.189  [3091] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  61.544  [3159] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  66.900  [1835] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  72.256  [940]  |∎∎∎∎∎∎∎∎∎∎∎∎
  77.612  [513]  |∎∎∎∎∎∎
  82.967  [220]  |∎∎∎
  88.323  [96]   |∎
  93.679  [32]   |
  99.035  [8]    |
  104.390 [5]    |

Latency distribution:
  10 % in 53.92 ms 
  25 % in 55.48 ms 
  50 % in 58.87 ms 
  75 % in 64.52 ms 
  90 % in 71.39 ms 
  95 % in 75.72 ms 
  99 % in 84.87 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 100; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-100-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	170.11 s
  Slowest:	115.23 ms
  Fastest:	56.38 ms
  Average:	67.65 ms
  Requests/sec:	58.20

Response time histogram:
  56.377  [1]    |
  62.262  [3030] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  68.148  [3181] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  74.033  [1836] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  79.918  [959]  |∎∎∎∎∎∎∎∎∎∎∎∎
  85.803  [535]  |∎∎∎∎∎∎∎
  91.688  [233]  |∎∎∎
  97.574  [89]   |∎
  103.459 [24]   |
  109.344 [9]    |
  115.229 [3]    |

Latency distribution:
  10 % in 59.92 ms 
  25 % in 61.57 ms 
  50 % in 65.23 ms 
  75 % in 71.46 ms 
  90 % in 79.17 ms 
  95 % in 83.78 ms 
  99 % in 92.63 ms 

Status code distribution:
  [OK]   9900 responses   


Change only number of features
Entity rows: 1; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.00 s
  Slowest:	2.28 ms
  Fastest:	0.77 ms
  Average:	0.97 ms
  Requests/sec:	99.00

Response time histogram:
  0.766 [1]    |
  0.918 [3440] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.069 [4227] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.221 [2171] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.372 [37]   |
  1.524 [13]   |
  1.675 [7]    |
  1.826 [0]    |
  1.978 [0]    |
  2.129 [0]    |
  2.281 [4]    |

Latency distribution:
  10 % in 0.81 ms 
  25 % in 0.85 ms 
  50 % in 1.01 ms 
  75 % in 1.06 ms 
  90 % in 1.10 ms 
  95 % in 1.11 ms 
  99 % in 1.15 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 100; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-100.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.00 s
  Slowest:	2.95 ms
  Fastest:	1.31 ms
  Average:	1.64 ms
  Requests/sec:	99.00

Response time histogram:
  1.313 [1]    |
  1.477 [3561] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.641 [46]   |
  1.805 [5186] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.969 [1033] |∎∎∎∎∎∎∎∎
  2.133 [51]   |
  2.297 [11]   |
  2.462 [1]    |
  2.626 [3]    |
  2.790 [2]    |
  2.954 [5]    |

Latency distribution:
  10 % in 1.36 ms 
  25 % in 1.40 ms 
  50 % in 1.75 ms 
  75 % in 1.78 ms 
  90 % in 1.81 ms 
  95 % in 1.83 ms 
  99 % in 1.90 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 150; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-150.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.00 s
  Slowest:	3.87 ms
  Fastest:	1.90 ms
  Average:	2.36 ms
  Requests/sec:	99.00

Response time histogram:
  1.904 [1]    |
  2.100 [3459] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  2.297 [118]  |∎
  2.493 [71]   |
  2.690 [6137] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  2.887 [52]   |
  3.083 [39]   |
  3.280 [11]   |
  3.476 [0]    |
  3.673 [5]    |
  3.869 [7]    |

Latency distribution:
  10 % in 1.99 ms 
  25 % in 2.02 ms 
  50 % in 2.53 ms 
  75 % in 2.55 ms 
  90 % in 2.58 ms 
  95 % in 2.61 ms 
  99 % in 2.71 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 200; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-200.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.00 s
  Slowest:	5.26 ms
  Fastest:	2.45 ms
  Average:	3.05 ms
  Requests/sec:	99.00

Response time histogram:
  2.450 [1]    |
  2.731 [3708] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  3.011 [65]   |∎
  3.292 [1493] |∎∎∎∎∎∎∎∎∎∎∎∎∎
  3.573 [4531] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  3.854 [59]   |∎
  4.134 [16]   |
  4.415 [11]   |
  4.696 [8]    |
  4.977 [3]    |
  5.257 [5]    |

Latency distribution:
  10 % in 2.55 ms 
  25 % in 2.59 ms 
  50 % in 3.29 ms 
  75 % in 3.33 ms 
  90 % in 3.39 ms 
  95 % in 3.43 ms 
  99 % in 3.59 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 250; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-250.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.00 s
  Slowest:	7.65 ms
  Fastest:	3.03 ms
  Average:	3.77 ms
  Requests/sec:	99.00

Response time histogram:
  3.035 [1]    |
  3.496 [3481] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  3.958 [35]   |
  4.419 [6297] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  4.880 [60]   |
  5.342 [18]   |
  5.803 [4]    |
  6.265 [2]    |
  6.726 [0]    |
  7.188 [0]    |
  7.649 [2]    |

Latency distribution:
  10 % in 3.15 ms 
  25 % in 3.19 ms 
  50 % in 4.03 ms 
  75 % in 4.09 ms 
  90 % in 4.17 ms 
  95 % in 4.24 ms 
  99 % in 4.38 ms 

Status code distribution:
  [OK]   9900 responses   


Change only number of requests
Entity rows: 1; Features: 50; Concurrency: 4; RPS: 100
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 100 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	100.00 s
  Slowest:	1.93 ms
  Fastest:	0.76 ms
  Average:	0.94 ms
  Requests/sec:	99.00

Response time histogram:
  0.759 [1]    |
  0.876 [3782] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.993 [875]  |∎∎∎∎∎∎∎
  1.109 [5140] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.226 [66]   |∎
  1.343 [27]   |
  1.459 [5]    |
  1.576 [1]    |
  1.692 [0]    |
  1.809 [0]    |
  1.926 [3]    |

Latency distribution:
  10 % in 0.80 ms 
  25 % in 0.83 ms 
  50 % in 1.00 ms 
  75 % in 1.03 ms 
  90 % in 1.05 ms 
  95 % in 1.07 ms 
  99 % in 1.11 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 200
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 200 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	50.00 s
  Slowest:	6.59 ms
  Fastest:	0.75 ms
  Average:	0.94 ms
  Requests/sec:	197.99

Response time histogram:
  0.748 [1]    |
  1.332 [9886] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.916 [9]    |
  2.500 [3]    |
  3.084 [0]    |
  3.669 [0]    |
  4.253 [0]    |
  4.837 [0]    |
  5.421 [0]    |
  6.005 [0]    |
  6.589 [1]    |

Latency distribution:
  10 % in 0.79 ms 
  25 % in 0.82 ms 
  50 % in 0.99 ms 
  75 % in 1.02 ms 
  90 % in 1.04 ms 
  95 % in 1.06 ms 
  99 % in 1.12 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 300
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 300 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	33.33 s
  Slowest:	6.53 ms
  Fastest:	0.75 ms
  Average:	0.95 ms
  Requests/sec:	296.99

Response time histogram:
  0.751 [1]    |
  1.329 [9861] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.907 [33]   |
  2.485 [4]    |
  3.062 [0]    |
  3.640 [0]    |
  4.218 [0]    |
  4.796 [0]    |
  5.374 [0]    |
  5.951 [0]    |
  6.529 [1]    |

Latency distribution:
  10 % in 0.80 ms 
  25 % in 0.83 ms 
  50 % in 0.99 ms 
  75 % in 1.02 ms 
  90 % in 1.05 ms 
  95 % in 1.07 ms 
  99 % in 1.20 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 400
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 400 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	25.00 s
  Slowest:	2.25 ms
  Fastest:	0.75 ms
  Average:	0.95 ms
  Requests/sec:	395.97

Response time histogram:
  0.750 [1]    |
  0.900 [3540] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.050 [5410] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.200 [822]  |∎∎∎∎∎∎
  1.350 [79]   |∎
  1.500 [28]   |
  1.650 [11]   |
  1.800 [3]    |
  1.950 [2]    |
  2.100 [2]    |
  2.250 [2]    |

Latency distribution:
  10 % in 0.80 ms 
  25 % in 0.83 ms 
  50 % in 0.99 ms 
  75 % in 1.02 ms 
  90 % in 1.05 ms 
  95 % in 1.07 ms 
  99 % in 1.24 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 500
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 500 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	20.00 s
  Slowest:	2.17 ms
  Fastest:	0.74 ms
  Average:	0.96 ms
  Requests/sec:	494.95

Response time histogram:
  0.743 [1]    |
  0.885 [3178] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.027 [3978] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.170 [2544] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.312 [135]  |∎
  1.454 [38]   |
  1.596 [18]   |
  1.739 [3]    |
  1.881 [2]    |
  2.023 [0]    |
  2.165 [3]    |

Latency distribution:
  10 % in 0.80 ms 
  25 % in 0.84 ms 
  50 % in 1.00 ms 
  75 % in 1.03 ms 
  90 % in 1.06 ms 
  95 % in 1.08 ms 
  99 % in 1.26 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 600
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 600 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	16.67 s
  Slowest:	2.58 ms
  Fastest:	0.74 ms
  Average:	0.94 ms
  Requests/sec:	593.92

Response time histogram:
  0.741 [1]    |
  0.925 [3605] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.108 [5959] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.292 [221]  |∎
  1.475 [61]   |
  1.659 [32]   |
  1.843 [11]   |
  2.026 [7]    |
  2.210 [2]    |
  2.393 [0]    |
  2.577 [1]    |

Latency distribution:
  10 % in 0.79 ms 
  25 % in 0.82 ms 
  50 % in 0.98 ms 
  75 % in 1.02 ms 
  90 % in 1.05 ms 
  95 % in 1.07 ms 
  99 % in 1.32 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 700
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 700 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	14.29 s
  Slowest:	3.06 ms
  Fastest:	0.75 ms
  Average:	0.95 ms
  Requests/sec:	692.91

Response time histogram:
  0.747 [1]    |
  0.978 [4365] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.209 [5286] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.440 [137]  |∎
  1.671 [64]   |
  1.903 [24]   |
  2.134 [13]   |
  2.365 [5]    |
  2.596 [2]    |
  2.827 [1]    |
  3.058 [2]    |

Latency distribution:
  10 % in 0.79 ms 
  25 % in 0.82 ms 
  50 % in 0.99 ms 
  75 % in 1.02 ms 
  90 % in 1.05 ms 
  95 % in 1.08 ms 
  99 % in 1.47 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 800
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 800 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	12.50 s
  Slowest:	4.19 ms
  Fastest:	0.74 ms
  Average:	0.97 ms
  Requests/sec:	791.89

Response time histogram:
  0.737 [1]    |
  1.081 [8913] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.426 [821]  |∎∎∎∎
  1.771 [107]  |
  2.116 [30]   |
  2.461 [19]   |
  2.806 [5]    |
  3.151 [2]    |
  3.495 [0]    |
  3.840 [1]    |
  4.185 [1]    |

Latency distribution:
  10 % in 0.80 ms 
  25 % in 0.83 ms 
  50 % in 1.00 ms 
  75 % in 1.03 ms 
  90 % in 1.08 ms 
  95 % in 1.17 ms 
  99 % in 1.58 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 900
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 900 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	11.11 s
  Slowest:	6.59 ms
  Fastest:	0.73 ms
  Average:	0.96 ms
  Requests/sec:	890.88

Response time histogram:
  0.731 [1]    |
  1.316 [9627] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.902 [220]  |∎
  2.488 [38]   |
  3.073 [11]   |
  3.659 [1]    |
  4.244 [1]    |
  4.830 [0]    |
  5.416 [0]    |
  6.001 [0]    |
  6.587 [1]    |

Latency distribution:
  10 % in 0.79 ms 
  25 % in 0.82 ms 
  50 % in 0.99 ms 
  75 % in 1.03 ms 
  90 % in 1.07 ms 
  95 % in 1.14 ms 
  99 % in 1.66 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 4; RPS: 1000
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 1000 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	10.00 s
  Slowest:	4.51 ms
  Fastest:	0.74 ms
  Average:	0.98 ms
  Requests/sec:	989.86

Response time histogram:
  0.739 [1]    |
  1.116 [9057] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  1.494 [666]  |∎∎∎
  1.871 [125]  |∎
  2.249 [34]   |
  2.627 [6]    |
  3.004 [6]    |
  3.382 [2]    |
  3.759 [1]    |
  4.137 [0]    |
  4.514 [2]    |

Latency distribution:
  10 % in 0.80 ms 
  25 % in 0.83 ms 
  50 % in 1.00 ms 
  75 % in 1.04 ms 
  90 % in 1.10 ms 
  95 % in 1.20 ms 
  99 % in 1.67 ms 

Status code distribution:
  [OK]   9900 responses   


Fix uptime to 99.9% with 100ms timeout
Entity rows: 1; Features: 50; Concurrency: 10; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 0 \
-c 10 \
localhost:6566

Summary:
  Count:	9900
  Total:	2.75 s
  Slowest:	16.35 ms
  Fastest:	0.79 ms
  Average:	2.18 ms
  Requests/sec:	3604.85

Response time histogram:
  0.791  [1]    |
  2.347  [6743] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  3.903  [2665] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  5.458  [420]  |∎∎
  7.014  [34]   |
  8.570  [13]   |
  10.126 [10]   |
  11.681 [5]    |
  13.237 [4]    |
  14.793 [1]    |
  16.348 [4]    |

Latency distribution:
  10 % in 1.28 ms 
  25 % in 1.54 ms 
  50 % in 1.95 ms 
  75 % in 2.56 ms 
  90 % in 3.33 ms 
  95 % in 3.90 ms 
  99 % in 5.17 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 20; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 0 \
-c 20 \
localhost:6566

Summary:
  Count:	9900
  Total:	2.61 s
  Slowest:	21.92 ms
  Fastest:	0.84 ms
  Average:	3.74 ms
  Requests/sec:	3794.96

Response time histogram:
  0.838  [1]    |
  2.947  [3665] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  5.056  [4477] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  7.164  [1342] |∎∎∎∎∎∎∎∎∎∎∎∎
  9.273  [289]  |∎∎∎
  11.381 [60]   |∎
  13.490 [21]   |
  15.599 [20]   |
  17.707 [13]   |
  19.816 [5]    |
  21.924 [7]    |

Latency distribution:
  10 % in 1.83 ms 
  25 % in 2.52 ms 
  50 % in 3.40 ms 
  75 % in 4.55 ms 
  90 % in 5.95 ms 
  95 % in 6.91 ms 
  99 % in 9.80 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 30; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 0 \
-c 30 \
localhost:6566

Summary:
  Count:	9900
  Total:	2.48 s
  Slowest:	25.68 ms
  Fastest:	0.89 ms
  Average:	4.97 ms
  Requests/sec:	3987.41

Response time histogram:
  0.890  [1]    |
  3.369  [2515] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  5.847  [4561] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  8.326  [2011] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  10.805 [607]  |∎∎∎∎∎
  13.284 [108]  |∎
  15.762 [42]   |
  18.241 [28]   |
  20.720 [15]   |
  23.198 [10]   |
  25.677 [2]    |

Latency distribution:
  10 % in 2.35 ms 
  25 % in 3.35 ms 
  50 % in 4.60 ms 
  75 % in 6.09 ms 
  90 % in 7.92 ms 
  95 % in 9.18 ms 
  99 % in 13.23 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 40; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 0 \
-c 40 \
localhost:6566

Summary:
  Count:	9900
  Total:	2.48 s
  Slowest:	26.40 ms
  Fastest:	0.96 ms
  Average:	6.34 ms
  Requests/sec:	3997.13

Response time histogram:
  0.961  [1]    |
  3.505  [1572] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  6.048  [3753] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  8.592  [2637] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  11.136 [1155] |∎∎∎∎∎∎∎∎∎∎∎∎
  13.680 [517]  |∎∎∎∎∎∎
  16.224 [161]  |∎∎
  18.768 [66]   |∎
  21.312 [25]   |
  23.856 [11]   |
  26.400 [2]    |

Latency distribution:
  10 % in 2.92 ms 
  25 % in 4.20 ms 
  50 % in 5.79 ms 
  75 % in 7.83 ms 
  90 % in 10.50 ms 
  95 % in 12.27 ms 
  99 % in 16.32 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 50; Concurrency: 50; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-50.json \
--rps 0 \
-c 50 \
localhost:6566

Summary:
  Count:	9900
  Total:	2.41 s
  Slowest:	28.27 ms
  Fastest:	0.83 ms
  Average:	7.63 ms
  Requests/sec:	4104.14

Response time histogram:
  0.834  [1]    |
  3.578  [1043] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  6.322  [3060] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  9.066  [2959] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  11.810 [1580] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  14.554 [708]  |∎∎∎∎∎∎∎∎∎
  17.298 [327]  |∎∎∎∎
  20.042 [136]  |∎∎
  22.786 [56]   |∎
  25.530 [21]   |
  28.274 [9]    |

Latency distribution:
  10 % in 3.51 ms 
  25 % in 5.01 ms 
  50 % in 6.99 ms 
  75 % in 9.53 ms 
  90 % in 12.61 ms 
  95 % in 14.87 ms 
  99 % in 19.66 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 250; Concurrency: 10; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-250.json \
--rps 0 \
-c 10 \
localhost:6566

Summary:
  Count:	9900
  Total:	8.97 s
  Slowest:	32.42 ms
  Fastest:	3.19 ms
  Average:	7.98 ms
  Requests/sec:	1103.38

Response time histogram:
  3.186  [1]    |
  6.110  [2484] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  9.034  [4879] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  11.957 [1718] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  14.881 [547]  |∎∎∎∎
  17.805 [164]  |∎
  20.728 [63]   |∎
  23.652 [30]   |
  26.576 [5]    |
  29.499 [8]    |
  32.423 [1]    |

Latency distribution:
  10 % in 5.22 ms 
  25 % in 6.10 ms 
  50 % in 7.35 ms 
  75 % in 9.09 ms 
  90 % in 11.52 ms 
  95 % in 13.34 ms 
  99 % in 18.06 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 250; Concurrency: 20; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-250.json \
--rps 0 \
-c 20 \
localhost:6566

Summary:
  Count:	9900
  Total:	8.72 s
  Slowest:	60.60 ms
  Fastest:	3.60 ms
  Average:	13.71 ms
  Requests/sec:	1135.70

Response time histogram:
  3.598  [1]    |
  9.299  [2069] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  15.000 [4592] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  20.700 [2236] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  26.401 [680]  |∎∎∎∎∎∎
  32.101 [215]  |∎∎
  37.802 [70]   |∎
  43.502 [25]   |
  49.203 [8]    |
  54.903 [1]    |
  60.604 [3]    |

Latency distribution:
  10 % in 7.63 ms 
  25 % in 9.83 ms 
  50 % in 12.80 ms 
  75 % in 16.19 ms 
  90 % in 20.76 ms 
  95 % in 24.43 ms 
  99 % in 32.64 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 250; Concurrency: 30; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-250.json \
--rps 0 \
-c 30 \
localhost:6566

Summary:
  Count:	9900
  Total:	8.57 s
  Slowest:	71.75 ms
  Fastest:	3.59 ms
  Average:	19.24 ms
  Requests/sec:	1154.67

Response time histogram:
  3.594  [1]    |
  10.409 [1119] |∎∎∎∎∎∎∎∎∎∎∎∎∎
  17.225 [3494] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  24.040 [3036] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  30.856 [1360] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  37.672 [513]  |∎∎∎∎∎∎
  44.487 [246]  |∎∎∎
  51.303 [87]   |∎
  58.119 [28]   |
  64.934 [13]   |
  71.750 [3]    |

Latency distribution:
  10 % in 10.05 ms 
  25 % in 13.47 ms 
  50 % in 17.89 ms 
  75 % in 23.40 ms 
  90 % in 30.15 ms 
  95 % in 35.54 ms 
  99 % in 46.08 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 250; Concurrency: 40; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-250.json \
--rps 0 \
-c 40 \
localhost:6566

Summary:
  Count:	9900
  Total:	8.53 s
  Slowest:	117.88 ms
  Fastest:	3.61 ms
  Average:	24.37 ms
  Requests/sec:	1161.14

Response time histogram:
  3.609   [1]    |
  15.036  [1980] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  26.463  [4372] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  37.890  [2401] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  49.317  [848]  |∎∎∎∎∎∎∎∎
  60.744  [218]  |∎∎
  72.171  [57]   |∎
  83.598  [19]   |
  95.025  [2]    |
  106.452 [1]    |
  117.879 [1]    |

Latency distribution:
  10 % in 11.75 ms 
  25 % in 16.34 ms 
  50 % in 22.59 ms 
  75 % in 30.40 ms 
  90 % in 39.22 ms 
  95 % in 45.38 ms 
  99 % in 58.70 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 1; Features: 250; Concurrency: 50; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-1-250.json \
--rps 0 \
-c 50 \
localhost:6566

Summary:
  Count:	9900
  Total:	8.36 s
  Slowest:	102.90 ms
  Fastest:	3.72 ms
  Average:	28.48 ms
  Requests/sec:	1183.98

Response time histogram:
  3.724   [1]    |
  13.642  [1009] |∎∎∎∎∎∎∎∎∎∎∎∎∎
  23.559  [2938] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  33.477  [2990] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  43.395  [1693] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  53.312  [787]  |∎∎∎∎∎∎∎∎∎∎∎
  63.230  [314]  |∎∎∎∎
  73.148  [121]  |∎∎
  83.066  [38]   |∎
  92.983  [8]    |
  102.901 [1]    |

Latency distribution:
  10 % in 13.49 ms 
  25 % in 19.10 ms 
  50 % in 26.54 ms 
  75 % in 35.71 ms 
  90 % in 45.99 ms 
  95 % in 52.99 ms 
  99 % in 68.42 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 100; Features: 50; Concurrency: 2; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-100-50.json \
--rps 0 \
-c 2 \
localhost:6566

Summary:
  Count:	9900
  Total:	309.86 s
  Slowest:	100.85 ms
  Fastest:	55.35 ms
  Average:	61.59 ms
  Requests/sec:	31.95

Response time histogram:
  55.351  [1]    |
  59.900  [4396] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  64.450  [4072] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  69.000  [807]  |∎∎∎∎∎∎∎
  73.550  [249]  |∎∎
  78.100  [187]  |∎∎
  82.650  [122]  |∎
  87.200  [52]   |
  91.750  [9]    |
  96.299  [4]    |
  100.849 [1]    |

Latency distribution:
  10 % in 58.11 ms 
  25 % in 58.92 ms 
  50 % in 60.20 ms 
  75 % in 62.58 ms 
  90 % in 66.06 ms 
  95 % in 71.01 ms 
  99 % in 81.33 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 100; Features: 50; Concurrency: 4; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-100-50.json \
--rps 0 \
-c 4 \
localhost:6566

Summary:
  Count:	9900
  Total:	170.22 s
  Slowest:	111.29 ms
  Fastest:	56.32 ms
  Average:	67.71 ms
  Requests/sec:	58.16

Response time histogram:
  56.321  [1]    |
  61.817  [2769] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  67.314  [3074] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  72.811  [1845] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  78.307  [1067] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  83.804  [613]  |∎∎∎∎∎∎∎∎
  89.301  [299]  |∎∎∎∎
  94.798  [161]  |∎∎
  100.294 [44]   |∎
  105.791 [18]   |
  111.288 [9]    |

Latency distribution:
  10 % in 59.70 ms 
  25 % in 61.41 ms 
  50 % in 65.27 ms 
  75 % in 71.78 ms 
  90 % in 79.34 ms 
  95 % in 84.35 ms 
  99 % in 93.58 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 100; Features: 50; Concurrency: 6; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-100-50.json \
--rps 0 \
-c 6 \
localhost:6566

Summary:
  Count:	9900
  Total:	137.61 s
  Slowest:	145.72 ms
  Fastest:	57.85 ms
  Average:	82.03 ms
  Requests/sec:	71.94

Response time histogram:
  57.845  [1]    |
  66.633  [1127] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  75.420  [2769] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  84.208  [2382] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  92.995  [1589] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  101.783 [961]  |∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  110.570 [580]  |∎∎∎∎∎∎∎∎
  119.358 [299]  |∎∎∎∎
  128.145 [138]  |∎∎
  136.933 [40]   |∎
  145.720 [14]   |

Latency distribution:
  10 % in 66.08 ms 
  25 % in 71.18 ms 
  50 % in 78.97 ms 
  75 % in 90.16 ms 
  90 % in 102.63 ms 
  95 % in 110.55 ms 
  99 % in 124.41 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 100; Features: 50; Concurrency: 8; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-100-50.json \
--rps 0 \
-c 8 \
localhost:6566

Summary:
  Count:	9900
  Total:	128.71 s
  Slowest:	189.79 ms
  Fastest:	59.20 ms
  Average:	102.07 ms
  Requests/sec:	76.92

Response time histogram:
  59.199  [1]    |
  72.258  [335]  |∎∎∎∎∎
  85.317  [1671] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  98.376  [2925] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  111.435 [2158] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  124.494 [1362] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  137.553 [840]  |∎∎∎∎∎∎∎∎∎∎∎
  150.612 [400]  |∎∎∎∎∎
  163.671 [142]  |∎∎
  176.730 [51]   |∎
  189.789 [15]   |

Latency distribution:
  10 % in 79.25 ms 
  25 % in 87.38 ms 
  50 % in 98.50 ms 
  75 % in 114.19 ms 
  90 % in 130.60 ms 
  95 % in 140.58 ms 
  99 % in 159.46 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 100; Features: 50; Concurrency: 10; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-100-50.json \
--rps 0 \
-c 10 \
localhost:6566

Summary:
  Count:	9900
  Total:	131.27 s
  Slowest:	327.03 ms
  Fastest:	61.66 ms
  Average:	129.44 ms
  Requests/sec:	75.42

Response time histogram:
  61.656  [1]    |
  88.193  [790]  |∎∎∎∎∎∎∎∎∎∎
  114.730 [2788] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  141.267 [3111] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  167.804 [1946] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  194.341 [945]  |∎∎∎∎∎∎∎∎∎∎∎∎
  220.878 [247]  |∎∎∎
  247.415 [60]   |∎
  273.952 [8]    |
  300.489 [3]    |
  327.026 [1]    |

Latency distribution:
  10 % in 91.16 ms 
  25 % in 105.88 ms 
  50 % in 125.13 ms 
  75 % in 150.03 ms 
  90 % in 173.65 ms 
  95 % in 187.16 ms 
  99 % in 214.28 ms 

Status code distribution:
  [OK]   9900 responses   


Entity rows: 100; Features: 250; Concurrency: 2; RPS: 0
ghz --insecure -i protos/ --proto ./protos/ServingService.proto --call feast.serving.ServingService.GetOnlineFeaturesV2 --skipFirst=100 --cpus=4 \
-n 10000 \
--data-file requests-100-250.json \
--rps 0 \
-c 2 \
localhost:6566

Summary:
  Count:	836
  Total:	138.83 s
  Slowest:	357.15 ms
  Fastest:	274.97 ms
  Average:	293.54 ms
  Requests/sec:	6.02

Response time histogram:
  274.972 [1]   |
  283.189 [121] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  291.406 [299] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  299.624 [190] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  307.841 [120] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  316.059 [66]  |∎∎∎∎∎∎∎∎∎
  324.276 [24]  |∎∎∎
  332.494 [8]   |∎
  340.711 [5]   |∎
  348.929 [0]   |
  357.146 [1]   |

Latency distribution:
  10 % in 281.97 ms 
  25 % in 285.52 ms 
  50 % in 291.18 ms 
  75 % in 300.85 ms 
  90 % in 309.31 ms 
  95 % in 314.89 ms 
  99 % in 329.29 ms 

Status code distribution:
  [OK]            835 responses   
  [Unavailable]   1 responses     

Error distribution:
  [1]   rpc error: code = Unavailable desc = transport is closing